Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.IsValidCircuitNamingSchemeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.
aDocument:
The document.
circuitNamingSchemeId:
The circuit naming scheme id to be checked.
Returns:
True if the circuit naming scheme id is valid for CircuitNamingSchemeSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.GetCircuitNamingSchemeSettings(Autodesk.Revit.DB.Document)
Gets the circuit naming scheme settings of the project.
cda:
The document.
Returns:
The circuit naming scheme settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.CircuitNamingSchemeId
The circuit naming scheme id set in CircuitNamingSchemeSettings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The circuit naming scheme id is invalid for the CircuitNamingSchemeSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
This class represents a circuit naming scheme settings in Autodesk Revit.
Since:
2021